CREATE EXTENSION IF NOT EXISTS tablefunc;

create table "Занятие"
(
    id integer not null primary key,
    "Название" text
);

create table "Расписание"
(
    "Курс"   integer,
    "Неделя" integer,
    "День"   integer,
    "ЗН_id"  integer
        references "Занятие"
);

INSERT INTO "Занятие" (id, "Название")
VALUES
(10,'ТО'),
(3,'В'),
(4,'ПР'),
(0,'Х');

INSERT INTO "Расписание" ("Курс", "Неделя", "День", "ЗН_id")
VALUES
(1,1,1,null),
(1,1,2,null),
(1,1,3,null),
(1,1,4,0),
(1,1,5,0),
(1,1,6,0),
(1,1,7,3),
(1,2,1,10),
(1,2,2,10),
(1,2,3,10),
(1,2,4,10),
(1,2,5,10),
(1,2,6,10),
(1,2,7,3),
(1,3,1,10),
(1,3,2,10),
(1,3,3,10),
(1,3,4,10),
(1,3,5,10),
(1,3,6,10),
(1,3,7,3),
(1,4,1,10),
(1,4,2,10),
(1,4,3,10),
(1,4,4,10),
(1,4,5,10),
(1,4,6,10),
(1,4,7,3),
(1,5,1,10),
(1,5,2,10),
(1,5,3,10),
(1,5,4,10),
(1,5,5,10),
(1,5,6,10),
(1,5,7,3),
(1,6,1,10),
(1,6,2,10),
(1,6,3,10),
(1,6,4,10),
(1,6,5,10),
(1,6,6,10),
(1,6,7,3),
(1,7,1,10),
(1,7,2,10),
(1,7,3,10),
(1,7,4,10),
(1,7,5,10),
(1,7,6,10),
(1,7,7,3),
(1,8,1,10),
(1,8,2,10),
(1,8,3,10),
(1,8,4,10),
(1,8,5,10),
(1,8,6,10),
(1,8,7,3),
(1,9,1,4),
(1,9,2,4),
(1,9,3,4),
(1,9,4,4),
(1,9,5,4),
(1,9,6,4),
(1,9,7,3),
(1,10,1,10),
(1,10,2,10),
(1,10,3,10),
(1,10,4,10),
(1,10,5,10),
(1,10,6,10),
(1,10,7,3),
(1, 7, 4, 4);

SELECT * FROM crosstab(
  'SELECT "Неделя", "День", "Название" FROM "Расписание" JOIN "Занятие" ON "Расписание"."ЗН_id" = "Занятие"."id" ORDER BY "Неделя", "День"',
  'SELECT generate_series(1, 7)'
) AS ct("Неделя" int, "Пн" text, "Вт" text, "Ср" text, "Чт" text, "Пт" text, "Сб" text, "Вс" text);

SELECT * FROM crosstab(
  'SELECT "День", "Неделя", "Название" FROM "Расписание" JOIN "Занятие" ON "Расписание"."ЗН_id" = "Занятие"."id" ORDER BY "День", "Неделя"',
  'SELECT generate_series(1, 10)'
) AS ct("День" int, "Неделя 1" text, "Неделя 2" text, "Неделя 3" text, "Неделя 4" text, "Неделя 5" text, "Неделя 6" text, "Неделя 7" text, "Неделя 8" text, "Неделя 9" text, "Неделя 10" text);




SELECT * FROM crosstab(
  'SELECT "Неделя", "День", string_agg("Занятие"."Название", '', '') as "Занятия" 
   FROM "Расписание" LEFT JOIN "Занятие" 
   ON "Расписание"."ЗН_id" = "Занятие".id 
   GROUP BY "Неделя", "День" 
   ORDER BY "Неделя", "День"',
  'SELECT DISTINCT "День" FROM "Расписание" ORDER BY "День"'
) AS ct ("Неделя" int, "Понедельник" text, "Вторник" text, "Среда" text, "Четверг" text, "Пятница" text, "Суббота" text, "Воскресенье" text);

